src/test/resources/file_endpoint/input/Upload.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<SOAP-ENV:Header>
		<cwmp:ID SOAP-ENV:mustUnderstand="1">ID:intrnl.unset.id.Upload1345013027757.5358475</cwmp:ID>
		<cwmp:NoMoreRequests>0</cwmp:NoMoreRequests>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<cwmp:Upload xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
			<CommandKey>daCommand</CommandKey>
			<FileType>2 Vendor Log File</FileType>
			<URL>http://192.168.1.120:8080/openacs/</URL>
			<Username></Username>
			<Password></Password>
			<DelaySeconds>0</DelaySeconds>
		</cwmp:Upload>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>